MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60FN1M0VMD15/mcu.h
#define HU                            0x7F80000000      // CRC High Upper Byte
#define HL                            0x7F800000      // CRC High Lower Byte
#define LU                            0x007F8000      // CRC Low Upper Byte
#define LL                            0x00007F80      // CRC Low Lower Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_GPOLY register.
//
//*****************************************************************************

#define HIGH                          0x7FFF80000000      // High Polynominal Half-word
#define LOW                           0x7FFF8000      // Low Polynominal Half-word


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_CTRL register.
//
//*****************************************************************************

#define -                             0x7FFF80000000      // Reserved
#define -                             0x00018000      // Reserved
#define -                             0x00006000      // Reserved
#define -                             0x00001800      // Reserved
#define -                             0x00000600      // Reserved
#define -                             0x00000180      // Reserved
#define -                             0x00000060      // Reserved
#define -                             0x00000018      // Reserved
#define -                             0x00000006      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CASR register.
//
//*****************************************************************************

#define VER                           0x780000000      // CAU Version
#define DPE                           0x00000002      // DES Parity Error
#define IC                            0x00000001      // Illegal Command


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAA register.
//
//*****************************************************************************

#define ACC                           0x7FFFFFFF80000000      // Accumulator


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAn register.
//
//*****************************************************************************

#define CAn                           0x7FFFFFFF80000000      // General Purpose Registers ::


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_CR register.
//
//*****************************************************************************

#define SLP                           0x00000010      // Specifies whether RNGA is in Sleep or Normal mode
#define CLRI                          0x00000008      // Clears the interrupt by resetting the error-interrupt indicator (SR[ERRI])
#define INTM                          0x00000004      // Masks the triggering of an error interrupt to the interrupt controller when an OR underflow condition occurs
#define HA                            0x00000002      // Enables notification of security violations (via SR[SECV])
#define GO                            0x00000001      // Specifies whether random-data generation and loading (into OR[RANDOUT]) is enabled


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_SR register.
//
//*****************************************************************************

#define OREG_SIZE                     0x7F800000      // Indicates the size of the Output (OR) register in terms of the number of 32-bit random-data words it can hold
#define OREG_LVL                      0x007F8000      // Indicates the number of random-data words that are in OR[RANDOUT], which indicates whether OR[RANDOUT] is valid
#define SLP                           0x00000010      // Specifies whether RNGA is in Sleep or Normal mode
#define ERRI                          0x00000008      // Indicates whether an OR underflow condition has occurred since you last cleared the error interrupt (CR[CLRI]) or RNGA was reset, regardless of whether the error interrupt is masked (CR[INTM])
#define ORU                           0x00000004      // Indicates whether an OR underflow condition has occurred since you last read this register (SR) or RNGA was reset, regardless of whether the error interrupt is masked (CR[INTM])
#define LRS                           0x00000002      // Indicates whether the most recent read of OR[RANDOUT] caused an OR underflow condition, regardless of whether the error interrupt is masked (CR[INTM])
#define SECV                          0x00000001      // Used only when high assurance is enabled (CR[HA])


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_ER register.
//
//*****************************************************************************

#define EXT_ENT                       0x7FFFFFFF80000000      // Specifies an entropy value that RNGA uses in addition to its ring oscillators to seed its pseudorandom algorithm ::


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_OR register.
//
//*****************************************************************************

#define RANDOUT                       0x7FFFFFFF80000000      // Stores a random-data word generated by RNGA ::


//*****************************************************************************
//
// The following are defines for the bit fields in the VREF_TRM register.
//
//*****************************************************************************

#define TRIM                          0x000007E0      // Trim bits


//*****************************************************************************
//
// The following are defines for the bit fields in the VREF_SC register.
//
//*****************************************************************************

